
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ОстаткиМатериалов.Записывать = Истина;
	Движения.ОстаткиМатериалов.Очистить();
	
	Движения.ВыручкаМастерской.Записывать = Истина;
	Движения.ОстаткиМатериалов.Очистить();
	
	Для Каждого ТекСтрМат Из Материалы Цикл
		
		Движение = Движения.ОстаткиМатериалов.ДобавитьРасход();
		Движение.Период = Дата;
		Движение.Товар = ТекСтрМат.Товар;
		Движение.Количество = ТекСтрМат.Количество;
		
	КонецЦикла;
	
	Для Каждого ТекСтрУсл из Услуги Цикл
		
		Движение = Движения.ВыручкаМастерской.Добавить();
		Движение.Период = Дата;
		Движение.Автомобиль = Автомобиль;
		Движение.Услуга = ТекСтрУсл.Услуга;
		Движение.Сумма = ТекСтрУсл.Стоимость;
		
	КонецЦикла;
	
КонецПроцедуры
